In [46]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [47]:
#NaN 也就是不是一个数字
np.nan
type(np.nan)

float

In [48]:
a = 1
b= np.nan
type(a)

int

In [49]:
c = a + b
c

nan

In [50]:
1.0 + np.nan

nan

In [51]:
1.0*np.nan

nan

In [52]:
#在series里的NaN
s1 = Series([1,2,np.nan,np.nan],index=['A','B','C','D'])

In [53]:
s1

A    1.0
B    2.0
C    NaN
D    NaN
dtype: float64

In [54]:
s1.isnull()

A    False
B    False
C     True
D     True
dtype: bool

In [55]:
s1.notnull()

A     True
B     True
C    False
D    False
dtype: bool

In [56]:
s1.dropna()

A    1.0
B    2.0
dtype: float64

In [57]:
#Dataframe里的Nan
df = DataFrame([[1,2,3],[4,np.nan,6],[7,np.nan,9]])
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [58]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False   True  False

In [59]:
df.notnull()

      0      1     2
0  True   True  True
1  True  False  True
2  True  False  True

In [60]:
df.dropna(how='all') #加入how不会更改index的值
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [61]:
df = DataFrame([[1,2,3,4],[5,np.nan,np.nan,8],[np.nan,np.nan,np.nan]])
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  NaN  NaN  8.0
2  NaN  NaN  NaN  NaN

In [29]:
df.dropna(aixs=1,how='all') #只返回Index是0的 Axis按列操作 没有变化

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  NaN  NaN  8.0

In [63]:
df.dropna(axis=1,how='any')
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  NaN  NaN  8.0
2  NaN  NaN  NaN  NaN

In [66]:
df.fillna({1:1,2:2}) #

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  1.0  2.0  8.0
2  NaN  1.0  2.0  NaN